JPeace90/Sensor-node-6lowpan/Middlewares/ST/Contiki_STM32_Library/Src/spirit1.c
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit1_printstatus
  * 	prints to the UART the status of the spirit1 radio
  * @param  none
  * @retval None
  */
void
spirit1_printstatus(void)
{
  int s = SPIRIT1_STATUS();
  if(s == SPIRIT1_STATE_STANDBY) {
    printf("spirit1: SPIRIT1_STATE_STANDBY\n");
  } else if(s == SPIRIT1_STATE_READY) {
    printf("spirit1: SPIRIT1_STATE_READY\n");
  } else if(s == SPIRIT1_STATE_TX) {
    printf("spirit1: SPIRIT1_STATE_TX\n");
  } else if(s == SPIRIT1_STATE_RX) {
    printf("spirit1: SPIRIT1_STATE_RX\n");
  } else {
    printf("spirit1: status: %d\n", s);
  }
}
/*---------------------------------------------------------------------------*/
/* Strobe a command. The rationale for this is to clean up the messy legacy code. */
/**
  * @brief  spirit1_strobe
  * 	strobe a command to the Spirit1 radio
  * @param  uint8_t s
  * @retval None
  */
static void
spirit1_strobe(uint8_t s)
{
  st_lib_spirit_cmd_strobe_command((SpiritCmd)s);
}
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit_set_ready_state
  * 	sets the state of the Spirit1 radio to READY
  * @param  none
  * @retval None
  */
void spirit_set_ready_state(void)
{
  PRINTF("READY IN\n");

  st_lib_spirit_irq_clear_status();
  SPIRIT1_IRQ_DISABLE();

  if(SPIRIT1_STATUS() == SPIRIT1_STATE_STANDBY) {
    spirit1_strobe(SPIRIT1_STROBE_READY);
  } else if(SPIRIT1_STATUS() == SPIRIT1_STATE_RX) {
    spirit1_strobe(SPIRIT1_STROBE_SABORT);
    st_lib_spirit_irq_clear_status();
  }

  SPIRIT1_IRQ_ENABLE();

  PRINTF("READY OUT\n");
}
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit_radio_init
  * 	initialises the Spirit1 radio
  * @param  none
  * @retval int result(0 == success)
  */
static int
spirit_radio_init(void)
{ 

  PRINTF("RADIO INIT IN\n");

  st_lib_spirit_spi_init();
  
  /* Configure radio shut-down (SDN) pin and activate radio */
  st_lib_radio_gpio_init(RADIO_GPIO_SDN, RADIO_MODE_GPIO_OUT);
  
  /* Configures the SPIRIT1 library */
  st_lib_spirit_radio_set_xtal_frequency(XTAL_FREQUENCY);
  
  /* wake up to READY state */
  /* weirdly enough, this *should* actually *set* the pin, not clear it! The pins is declared as GPIO_pin13 == 0x2000 */
  RADIO_GPIO_SDN_PORT->BSRR = RADIO_GPIO_SDN_PIN; 
  st_lib_hal_gpio_write_pin(RADIO_GPIO_SDN_PORT, RADIO_GPIO_SDN_PIN,GPIO_PIN_RESET);

  /* wait minimum 1.5 ms to allow SPIRIT1 a proper boot-up sequence */
  BUSYWAIT_UNTIL(0, 3 * RTIMER_SECOND/2000);
  
  /* Soft reset of core */
  spirit1_strobe(SPIRIT1_STROBE_SRES);
  
  /* Configures the SPIRIT1 radio part */
  st_lib_s_radio_init x_radio_init = {
    XTAL_OFFSET_PPM,
    BASE_FREQUENCY,
    CHANNEL_SPACE,
    CHANNEL_NUMBER, 
    MODULATION_SELECT,
    DATARATE,
    FREQ_DEVIATION,
    BANDWIDTH
  };
  st_lib_spirit_radio_init(&x_radio_init);
  st_lib_spirit_radio_set_pa_level_dbm(0,POWER_DBM);
  st_lib_spirit_radio_set_pa_level_max_index(0);
  
  /* Configures the SPIRIT1 packet handler part*/
  st_lib_pkt_basic_init x_basic_init = {
    PREAMBLE_LENGTH,
    SYNC_LENGTH,
    SYNC_WORD,
    LENGTH_TYPE,
    LENGTH_WIDTH,
    CRC_MODE,
    CONTROL_LENGTH,
    EN_ADDRESS,
    EN_FEC,
    EN_WHITENING
  };
  st_lib_spirit_pkt_basic_init(&x_basic_init);
  
  /* Enable the following interrupt sources, routed to GPIO */
  st_lib_spirit_irq_de_init(NULL);
  st_lib_spirit_irq_clear_status();
  st_lib_spirit_irq(TX_DATA_SENT, S_ENABLE);
  st_lib_spirit_irq(RX_DATA_READY,S_ENABLE);
  st_lib_spirit_irq(VALID_SYNC,S_ENABLE);
  st_lib_spirit_irq(RX_DATA_DISC, S_ENABLE);
  st_lib_spirit_irq(TX_FIFO_ERROR, S_ENABLE);
  st_lib_spirit_irq(RX_FIFO_ERROR, S_ENABLE);

  /* Configure Spirit1 */
  st_lib_spirit_radio_persisten_rx(S_ENABLE);
  st_lib_spirit_qi_set_sqi_threshold(SQI_TH_0);
  st_lib_spirit_qi_sqi_check(S_ENABLE);
  st_lib_spirit_qi_set_rssi_threshold_dbm(RSSI_RX_THRESHOLD);
  st_lib_spirit_timer_set_rx_timeout_stop_condition(SQI_ABOVE_THRESHOLD);
  SET_INFINITE_RX_TIMEOUT();
  st_lib_spirit_radio_afc_freeze_on_sync(S_ENABLE);
  
  /* Puts the SPIRIT1 in STANDBY mode (125us -> rx/tx) */
  spirit1_strobe(SPIRIT1_STROBE_STANDBY);
  spirit_on = OFF;
  CLEAR_RXBUF();
  CLEAR_TXBUF();
  
  /* Initializes the mcu pin as input, used for IRQ */
  st_lib_radio_gpio_init(RADIO_GPIO_IRQ, RADIO_MODE_EXTI_IN);
  
  /* Configure the radio to route the IRQ signal to its GPIO 3 */
  st_lib_spirit_gpio_init(&(st_lib_s_gpio_init){
	  	  	  	  	  	  	  SPIRIT_GPIO_IRQ,
	                          SPIRIT_GPIO_MODE_DIGITAL_OUTPUT_LP,
							  SPIRIT_GPIO_DIG_OUT_IRQ}
						  );

  process_start(&spirit_radio_process, NULL);

  PRINTF("Spirit1 init done\n");
  return 0;
}
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit_radio_prepare
  * 	prepares the Spirit1 radio
  * @param  none
  * @retval int result(0 == success)
  */
static int
spirit_radio_prepare(const void *payload, unsigned short payload_len)
{
  PRINTF("Spirit1: prep %u\n", payload_len);
  packet_is_prepared = 0;

  /* Checks if the payload length is supported */
  if(payload_len > MAX_PACKET_LEN) {
    return RADIO_TX_ERR;
  }

  /* Should we delay for an ack? */
#if NULLRDC_CONF_802154_AUTOACK
  frame802154_t info154;
  wants_an_ack = 0;
  if(payload_len > ACK_LEN
      && frame802154_parse((char*)payload, payload_len, &info154) != 0) {
    if(info154.fcf.frame_type == FRAME802154_DATAFRAME
        && info154.fcf.ack_required != 0) {
      wants_an_ack = 1;
    }
  }
#endif /* NULLRDC_CONF_802154_AUTOACK */

  /* Sets the length of the packet to send */
  SPIRIT1_IRQ_DISABLE();
  spirit1_strobe(SPIRIT1_STROBE_FTX);
  st_lib_spirit_pkt_basic_set_payload_length(payload_len);
  st_lib_spirit_spi_write_linear_fifo(payload_len, (uint8_t *)payload);
  SPIRIT1_IRQ_ENABLE();
  
  PRINTF("PREPARE OUT\n");

  packet_is_prepared = 1;
  return RADIO_TX_OK;
}
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit_radio_transmit
  * 	transimts a packet with the Spirit1 radio
  * @param  unsigned short payload_len
  * @retval int result(0 == success)
  */
static int
spirit_radio_transmit(unsigned short payload_len)
{ 
  /* This function blocks until the packet has been transmitted */

