JPeace90/Sensor-node-6lowpan/Middlewares/ST/Contiki_STM32_Library/Src/spirit1.c
  PRINTF("TRANSMIT IN\n");
  if(!packet_is_prepared) {
    return RADIO_TX_ERR;
  }

  /* Stores the length of the packet to send */
  /* Others spirit_radio_prepare will be in hold */
  spirit_txbuf[0] = payload_len;
  
  /* Puts the SPIRIT1 in TX state */
  receiving_packet = 0;
  spirit_set_ready_state(); 
  spirit1_strobe(SPIRIT1_STROBE_TX);

#if XXX_ACK_WORKAROUND || NULLRDC_CONF_802154_AUTOACK
  just_got_an_ack = 0;
#endif /* XXX_ACK_WORKAROUND */

  BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_TX, 1 * RTIMER_SECOND/1000);
  //BUSYWAIT_UNTIL(SPIRIT1_STATUS() != SPIRIT1_STATE_TX, 4 * RTIMER_SECOND/1000); //For GFSK with high data rate
  BUSYWAIT_UNTIL(SPIRIT1_STATUS() != SPIRIT1_STATE_TX, 50 * RTIMER_SECOND/1000); //For FSK with low data rate

  /* Reset radio - needed for immediate RX of ack */
  if(!IS_TXBUF_EMPTY())
  {
	  CLEAR_TXBUF();
  }

  if(!IS_RXBUF_EMPTY())
  {
	  CLEAR_RXBUF();
  }

  SPIRIT1_IRQ_DISABLE();
  st_lib_spirit_irq_clear_status();
  spirit1_strobe(SPIRIT1_STROBE_SABORT);
  BUSYWAIT_UNTIL(0, RTIMER_SECOND/2500);
  spirit1_strobe(SPIRIT1_STROBE_READY);
  BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_READY, 1 * RTIMER_SECOND/1000);
  spirit1_strobe(SPIRIT1_STROBE_RX);
  BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_RX, 1 * RTIMER_SECOND/1000);
  SPIRIT1_IRQ_ENABLE();

#if XXX_ACK_WORKAROUND
  just_got_an_ack = 1;
#endif /* XXX_ACK_WORKAROUND */

#if NULLRDC_CONF_802154_AUTOACK
  if (wants_an_ack) {
    rtimer_txdone = RTIMER_NOW();
    BUSYWAIT_UNTIL(just_got_an_ack, 2 * RTIMER_SECOND/1000);
    rtimer_rxack = RTIMER_NOW();

    if(just_got_an_ack) {
      ACKPRINTF("debug_ack: ack received after %u/%u ticks\n",
             (uint32_t)(rtimer_rxack - rtimer_txdone), 2 * RTIMER_SECOND/1000);
    } else {
      ACKPRINTF("debug_ack: no ack received\n");
    }
  }
#endif /* NULLRDC_CONF_802154_AUTOACK */

  PRINTF("TRANSMIT OUT\n");

  if(!IS_TXBUF_EMPTY())
  {
	  CLEAR_TXBUF();
  }

  packet_is_prepared = 0;

  clock_wait(1);

  return RADIO_TX_OK;
}
/*---------------------------------------------------------------------------*/
static int spirit_radio_send(const void *payload, unsigned short payload_len)
{
  if(spirit_radio_prepare(payload, payload_len) == RADIO_TX_ERR) {
    return RADIO_TX_ERR;
  } 

  return spirit_radio_transmit(payload_len);
  
}
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit_radio_read
  * 	reads a packet received with the Spirit1 radio
  * @param  void *buf, unsigned short bufsize
  * @retval int bufsize
  */
static int spirit_radio_read(void *buf, unsigned short bufsize)
{  
  PRINTF("READ IN\n");
  
  /* Checks if the RX buffer is empty */
  if(IS_RXBUF_EMPTY()) {
    SPIRIT1_IRQ_DISABLE();
    CLEAR_RXBUF();
    spirit1_strobe(SPIRIT1_STROBE_SABORT);
    BUSYWAIT_UNTIL(0, RTIMER_SECOND/2500);
    spirit1_strobe(SPIRIT1_STROBE_READY);
    BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_READY, 1 * RTIMER_SECOND/1000);
    spirit1_strobe(SPIRIT1_STROBE_RX);
    BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_RX, 1 * RTIMER_SECOND/1000);
    PRINTF("READ OUT RX BUF EMPTY\n");
    SPIRIT1_IRQ_ENABLE();
    return 0;
  }
  
  if(bufsize < spirit_rxbuf[0]) { 
    /* If buf has the correct size */
    PRINTF("TOO SMALL BUF\n");
    return 0;
  } else {
    /* Copies the packet received */
    memcpy(buf, spirit_rxbuf + 1, spirit_rxbuf[0]);

    packetbuf_set_attr(PACKETBUF_ATTR_RSSI, last_rssi);        //MGR
    packetbuf_set_attr(PACKETBUF_ATTR_LINK_QUALITY, last_lqi); //MGR
    bufsize = spirit_rxbuf[0];
    CLEAR_RXBUF();
    
    PRINTF("READ OUT\n");
    
    return bufsize;
  }  
  
}
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit_radio_channel_clear
  * 	checks the channel
  * @param  none
  * @retval int result
  */
static int
spirit_radio_channel_clear(void)
{
  float rssi_value;
  /* Local variable used to memorize the SPIRIT1 state */
  uint8_t spirit_state = spirit_on;//ON;//MGR see below
  
  PRINTF("CHANNEL CLEAR IN\n");

  if(spirit_on == OFF) {
    /* Wakes up the SPIRIT1 */
    spirit_radio_on();
    //spirit_state = OFF;//MGR: check this is different from original contiki
  }
  
  SPIRIT1_IRQ_DISABLE();
  spirit1_strobe(SPIRIT1_STROBE_SABORT);
  st_lib_spirit_irq_clear_status();

  SPIRIT1_IRQ_ENABLE();
  {
    rtimer_clock_t timeout = RTIMER_NOW() + 5 * RTIMER_SECOND/1000;
    do {
      st_lib_spirit_refresh_status();
    } while((st_lib_g_x_status.MC_STATE != MC_STATE_READY) && (RTIMER_NOW() < timeout));
//    if(RTIMER_NOW() < timeout) {
    /* Modified EP */
    if(st_lib_g_x_status.MC_STATE != MC_STATE_READY) {
      return 1;
    }
  }

  /* Stores the RSSI value */
  rssi_value = st_lib_spirit_qi_get_rssi_dbm();
  
  /* Puts the SPIRIT1 in its previous state */
  if(spirit_state==OFF) {
    spirit_radio_off();
  } else {
    spirit1_strobe(SPIRIT1_STROBE_RX);
/*    SpiritCmdStrobeRx();*/
    BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_RX, 5 * RTIMER_SECOND/1000);
  }
  
  PRINTF("CHANNEL CLEAR OUT\n");
  
  /* Checks the RSSI value with the threshold */
  if(rssi_value<(float)RSSI_TX_THRESHOLD) {
    return 0;
  } else {
    return 1;
  }
}
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit_radio_receiving_packet
  * 	checks for receiving packet
  * @param  none
  * @retval int result
  */
static int
spirit_radio_receiving_packet(void)
{
  return receiving_packet;
}
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit_radio_receiving_packet
  * 	checks for pending packet
  * @param  none
  * @retval int result
  */
static int
spirit_radio_pending_packet(void)
{
  PRINTF("PENDING PACKET\n");
  return !IS_RXBUF_EMPTY();
}
/*---------------------------------------------------------------------------*/
/**
  * @brief  spirit_radio_off
  * 	turns off the Spirit1 radio
  * @param  none
  * @retval int result(0 == success)
  */
static int
spirit_radio_off(void)
{  
  PRINTF("Spirit1: ->off\n");
  if(spirit_on == ON) {
    /* Disables the mcu to get IRQ from the SPIRIT1 */
    SPIRIT1_IRQ_DISABLE();

    /* first stop rx/tx */
    spirit1_strobe(SPIRIT1_STROBE_SABORT);

    /* Clear any pending irqs */
    st_lib_spirit_irq_clear_status();
    
    BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_READY, 5 * RTIMER_SECOND/1000);
    if(SPIRIT1_STATUS() != SPIRIT1_STATE_READY) {
      PRINTF("Spirit1: failed off->ready\n");
      return 1;
    }

    /* Puts the SPIRIT1 in STANDBY */
    spirit1_strobe(SPIRIT1_STROBE_STANDBY);
    BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_STANDBY, 5 * RTIMER_SECOND/1000);
    if(SPIRIT1_STATUS() != SPIRIT1_STATE_STANDBY) {
      PRINTF("Spirit1: failed off->stdby\n");
      return 1;
    }

